'''
   클래스(class)
   1. 클래스 개념 사용하는 프로그램 언어: 자바, C++, 자바스크립트, python
   2. 객체 지향 프로그래밍 방법론에서 등장한 개념이다.
     ( OOP: Object Oriented Programming:  객체 지향 프로그래밍 )

   3. 객체(object)?
     ==> 현실세계에서 주체(subject:자신)가 눈으로 보여지는 사물(대상)
      예> 책상, 노트북, 학생, 강사, 핸드폰,......

   4. 객체의 구성요소? ==> 객체는 속성과 동작으로 구성되어 있다.

     예> 노트북 객체
       가. 속성
          - 가격
          - 색상
          - 제조사, ...

       나. 동작
          - on
          - off
          - sound
          - movie play, ...

        * 개발 프로세스
        분석(객체추출)--> 설계(클래스 구축)---> 구현 ---> 테스트 ---> 배포

       예> 애완동물 관리 프로그램 개발 ---> 객체추출( 고양이 객체:
                                                  고양이 객체의 속성: 이름, 나이, 성별,....
                                                  고양이 객체의 동작: 먹다, 자다, 울고,....
           (고양이, 강아지,...)

               OOP 개념 적용(객체 지향 프로그래밍 방법론)
       현실세계  --------------------------->가상세계(python)
      고양이객체    -----------------------> 고양이 클래스
      속성: 이름,나이,...------------------>  (인스턴스)변수
      동작: 먹다. 자다,... ---------------->  메서드(함수)


'''