'''
   포맷 출력
   내용:  print 출력시 특정 형식을 맞춰서 출력

   방법:

      가.  "".format()  함수 => 최신 방식
         help('FORMATTING')
      나.   "" %       형식  ==> 이전 방식
'''

# 출력포맷:   이름:홍길동 , 나이: 20
# 출력포맷:   이름:이순신 , 나이: 30

# 4. "{}, {}".format() 함수

print("값1:{}".format(987654321))
print("값2:{0}".format(987654321))
print("-------------------------")
print("-------------------------")
print("값3:{0:f}".format(987654321)) # 987654321.000000
print("값4:{0:.2f}".format(987654321)) # 987654321.00
print("-------------------------")
print("-------------------------")
print("값5:{0:.3f}".format(98765.67889))
print("-------------------------")
print("-------------------------")
print("값6:{0:d}".format(9876))
print("값7:{0:10d}".format(9876))
print("-------------------------")
print("-------------------------")
print("값8:{0:,}".format(987654321)) # 화폐가정 987,654,321

help('FORMATTING')
